cask_'args appdir: '/Applications'

tap homebrew/homebrew-php
tap 'homebrew/bundle'

brew 'getantibody/tap/antibody'
brew 'git'
brew 'tree'
brew 'yarn'
brew 'ruby-build'
brew 'rbenv'
brew 'openssl'
brew 'node'
brew 'imagemagick'

cask '1password'
cask 'alfred'
cask 'codekit'
cask 'framer'
cask 'nvalt'
cask 'rescuetime'
cask 'vlc'
cask 'torbrowser'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'sequel-pro'
cask 'the-unarchiver'
cask 'iterm2'
cask 'sketch'
cask 'google-backup-and-sync'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'firefox'
