cask_args appdir: '/Applications'

tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/versions'

cask '1password'
cask 'alfred'
cask 'adobe-creative-cloud'
cask 'anaconda'
cask 'android-studio'
cask 'anki'
cask 'codekit'
cask 'contexts'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'rescuetime'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'sketch'
cask 'the-unarchiver'
cask 'transmission'
cask 'tower'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'zotero'

brew 'tree'
brew 'yarn'

# you probably already have git installed; ensure that it is the latest version
brew 'git'
brew 'git-lfs'
brew 'imagemagick'
