cask_args appdir: '/Applications'

tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/versions'

cask '1password'
cask 'alfred'
cask 'adobe-creative-cloud'
cask 'anki'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'rescuetime'
cask 'slack'
cask 'spotify'
cask 'sketch'
cask 'the-unarchiver'
cask 'transmission'
cask 'tower'
cask 'visual-studio-code'
cask 'zotero'

brew 'zsh'
brew 'tree'
brew 'ruby-build'
brew 'rbenv'
brew 'antibody'
brew 'git'
brew 'git-lfs'
brew 'node'
brew 'yarn'
brew 'php'
brew 'mysql'
brew 'imagemagick'
brew 'composer'
brew 'jupyter'
brew 'python3'

